In [4]:
import pandas as pd

In [3]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [19]:
#assignment 
# Q1. Data is 4,8,15,16,23, and 42 then print the series

In [5]:
data= [4,8,15,16,23,42]

In [6]:
data

[4, 8, 15, 16, 23, 42]

In [7]:
pd.Series(data)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [8]:
#Q2 10 elements in it and apply pandas series on it

In [12]:
Element =['a1','a2','a3','a4','a5','a6','a7','a8','a9','a10']

In [13]:
Element

['a1', 'a2', 'a3', 'a4', 'a5', 'a6', 'a7', 'a8', 'a9', 'a10']

In [14]:
type(Element)

list

In [15]:
pd.Series(Element)

0     a1
1     a2
2     a3
3     a4
4     a5
5     a6
6     a7
7     a8
8     a9
9    a10
dtype: object

In [7]:
#Q3 Which Fallowing Data Create Pandas DataFrame

In [5]:
import pandas as pd
pd.read_excel("Data List.xlsx")

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [17]:
pip install lxml

Collecting lxml
  Downloading lxml-4.9.2-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.manylinux_2_24_x86_64.whl (7.1 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 7.1/7.1 MB 58.4 MB/s eta 0:00:0000:0100:01
Installing collected packages: lxml
Successfully installed lxml-4.9.2
Note: you may need to restart the kernel to use updated packages.

In [8]:
#Q.4 What is 'DataFrame' in pandas and how is it diffrent from pandas.series give an eample.

In [9]:
 # A Data frame is two-dimensional data structure, i.e., data is aligned in a tabular fashion 
 # in rows and columns. Series can only contain single list index, whereas dataframe can be 
# made of more than one series.

In [10]:
#Exmaple of pandas.series and DataFrame

In [14]:
l1=['a2','a3','a4']

In [15]:
l1

['a2', 'a3', 'a4']

In [16]:
pd.Series(l1)

0    a2
1    a3
2    a4
dtype: object

In [32]:
#Example of Data Frame

In [33]:
# passing a list of DIC create a datafram

In [39]:
data=[{'a':1,'b':2},{'a':5,'b':10 ,'c':20},{'a':3, 'b':9,'c':10,'d':23}]

In [40]:
df=pd.DataFrame(data)

In [41]:
df

   a   b     c     d
0  1   2   NaN   NaN
1  5  10  20.0   NaN
2  3   9  10.0  23.0

In [37]:
#Q.5 common fun use to manipulation data in Pandas DataFrmae? Give any one Ex to use

In [42]:
#a. Dropping columns in the data.
#b.Dropping rows in the data.
#c.Renaming a column in the dataset.
#d.Select columns with specific data types.
#e. Slicing the dataset.

In [47]:
data=[{'a':1,'b':2},{'a':5,'b':10 ,'c':20},{'a':3, 'b':9,'c':10,'d':23}]

In [48]:
df=pd.DataFrame(data)

In [49]:
df

   a   b     c     d
0  1   2   NaN   NaN
1  5  10  20.0   NaN
2  3   9  10.0  23.0

In [50]:
# remove cloumn b and c

In [52]:
df.drop(columns=['b' ,'c'])

   a     d
0  1   NaN
1  5   NaN
2  3  23.0

In [53]:
#Q.6 mutuable in nature series ,Data Frame, Panel?

In [54]:
# all Pandas data structure are value mutuable (can be changed) and except Series all are size
# mutuable.

In [55]:
# Q.7 Create a Data Frame using multiple Series. Explain and Ex.

In [56]:
data= {'key1':[1,2,3] ,'key2' : ['Rohit','mantu' ,'pawan'] ,'key3' :[1.2,3.1,3.1]}

In [57]:
pd.DataFrame(data)

   key1   key2  key3
0     1  Rohit   1.2
1     2  mantu   3.1
2     3  pawan   3.1